/*******************************************************************************
*
* Copyright (C) 2022 Sharopin Yuri
*
* File              : Debug.c
* Compiler          : IAR EWA 8.32
* Version           : 0.0
* Created File      : 11.10.2022
* Last modified     : 11.10.2022
*
* Support mail      : yshar@ngs.ru
*
* Target MCU        : MCU:  @ (Xtal = MHz | CPUclk = MHz)
* Description       : Debuging
*                   : 
* Hardware          : .sch .pcb
*
********************************************************************************/
/**
  * @verbatim Описание
  *
  * @endverbatim
*/
/** @addtogroup ....
  * @{
  */
/** @defgroup Name 
  * @brief bla-bla-bla
  * @{
  */ 
  
/*===============================[ SPECIAL ]===================================*/ 
                      //  Условная компиляция
 
/*===============================[ IMPORT DECLARATIONS ]=======================*/ 
                      // Все системные, библиотечные и заголовочные файлы 
/* ----------------------------- [ System includes   ]-------------------------*/
//#include   <> //  MCS 
/*-------------------------------[ Platform level    ]-------------------------*/
//#include   <> //  IDE, OS
/*-------------------------------[ Standart libs     ]-------------------------*/
//#include   <> // 
/*-------------------------------[ Application Level ]-------------------------*/

#include    "main.h"          //
#include    "arm_itm.h"       //

/*===============================[ PRIVATE CONSTANTS ]=========================*/ 
// Все частные #defines и constants должны быть объявлены в данном разделе. 
/*===============================[ PRIVATE TYPES ]=============================*/ 
// Все частные типы, которые используются в данном исходном файле, должны быть объявлены в данном разделе.  
/*===============================[ PRIVATE VARIABLES ]=========================*/ 
// В этом разделе объявляются все частные переменные.  
/*===============================[ PUBLIC  VARIABLES ]=========================*/ 
// Все глобальные переменные должны быть заданы в этом разделе.  
/*===============================[ PRIVATE PSEUDO FUNCTIONS ]==================*/ 
// Все макросы должны быть объявлены в этом разделе.  
/*===============================[ PRIVATE FUNCTIONS ]=========================*/ 
// Все частные функции, используемые в данном исходном файле.
/** @defgroup 
  * @{
  */ 
/**
  * @}
  */
/*===============================[ PUBLIC FUNCTIONS ]==========================*/
// Все экспортируемые фукнции.
/**
  * @brief  Отладка с помощью модуля ITM
  * @param  itm_ch - канал блока ITM,  data - отладочная информация
  * @retval
  */
void DBG_ITM_Event( ITM_Channels_t itm_ch, uint32_t data )
{
//#if ( 1 == DEBUG_ITM )
  if ( ( itm_ch < 1 ) || ( itm_ch > 4 ) ) return; // todo "debug error"
  ITM_EVENT32_WITH_PC( itm_ch, data );
//#endif
}// DBG_ITM_Event()
/**
  * @}
  */
/**
  * @}
  */
 
/** (END OF FILE  : Debug.c) 
*******************************/ 
